module.exports = {
    // 系统错误码
    1001: '暂无数据',
    1002: '没有权限',
    1003: '请求参数错误',
    1004: '无效操作',
    1005: '数据库异常',
    1006: '缺失必要参数',
    1007: '环境参数错误',
    1009: '缺少环境参数',

    // 10xxx和user相关
    10001: '请先登录',
    10002: '该用户已经存在',
    10003: '该邮箱已经存在',
    10004: '该用户不存在',
    10005: '用户名或密码不正确',
    10006: '用户名或密码为空',
    10007: 'userid不存在',

    // 20xxx和item相关
    20001: '菜单id不存在',
    20002: '该用户已关注此项目',
    20003: '项目id不存在',
    20004: '你没有关注的项目', // 前端文字提示
    20005: '已存在用户星级列表中',
    20006: '不存在用户星级列表中',
    20007: '已存在的项目名称',
    20008: '已存在的目录名称',
    20009: '项目不存在',
    20010: '菜单中已存在相同项目id',
    20011: '项目id和名称不匹配',
    20012: 'osstype有误',
    20013: '上传zip错误或者找不到zip包',
    20014: 'zip没有文件'
}